app/Http/Controllers/CourseController.php

select * from `categories` where `categories`.`id` in (1, 2)
select * from `courses` limit 2 offset 0
select count(*) as aggregate from `courses`
---
    public function index()
    {
        // $courses = Course::all(); // lazy loading

        // I have added some code

        // eager loading
        $courses = Course::with('category')->paginate(2);